# Лабораторная работа 6: Поиск максимального числа

## 📋 Домашнее задание к работе №6

**Задание:** Даны три числа. Найдите наибольшее из них.

## 🧮 Алгоритм работы программы

1. Программа запрашивает у пользователя ввод трех чисел
2. Последовательно сравнивает числа между собой
3. Определяет наибольшее число
4. Выводит результат на экран

## 📁 Структура репозитория
Lab6/

├── Task.c   - # Исходный код программы

└── README.md

## 📝 Исходный код

```c
#define _CRT_SECURE_NO_WARNINGS
#include <stdio.h>
#include <locale.h>
#include <math.h>

int main() {
    setlocale(LC_CTYPE, "RUS");
    double x, y, z;
    double w = -INFINITY;
    
    printf("Введите число: ");
    scanf("%lf", &x);
    printf("Введите число: ");
    scanf("%lf", &y);
    printf("Введите число: ");
    scanf("%lf", &z);

    if (x >= y && x >= z) {
        w = x;
    }
    else if (y >= x && y >= z) {
        w = y;
    }
    else {
        w = z;
    }

    printf("Наибольшее число: %.2lf\n", w);
    return 0;
}
```
## Автор
Чапэ Максим Сергеевич

Группа: бТИИ-251